import 'package:flutter/material.dart';
import 'package:recook/constants/constants.dart';
import 'package:recook/widgets/recook/recook_scaffold.dart';

class OverseaAcceptLicensePage extends StatelessWidget {
  const OverseaAcceptLicensePage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return RecookScaffold(
      title: '跨境商品用户购买须知',
      body: SingleChildScrollView(
        padding: EdgeInsets.fromLTRB(
          rSize(16),
          rSize(10),
          rSize(16),
          rSize(40),
        ),
        child: Text(
          '''欢迎您使用由宁波商盟海市供应链管理有限公司（以下称“瑞库客）提供的各项服务。本协议为使用服务的用户（以下简称“用户或您”）和瑞库客达成的共识，具有法律效力。为了保障您的权利，请详细阅读以下所有内容，当您勾选“同意并接受《跨境商品用户购买须知》”时，该行为表示您同意且愿意遵守本《跨境商品用户购买须知》（以下简称“购买须知”）中的约定。

1、您承诺在瑞库客所购买的商品系个人合理自用，不得进行二次销售。

2、针对保税区发货的各种商品，您委托瑞库客代理申报、代缴税款等通关事宜。以上委托关系系如实填写，您愿意接受海关、检验检疫机构及其他监管部门的监管，并承担相应法律责任。

3、您在瑞库客购买的跨境商品等同于原产地直接销售商品，因此商品本身无中文标签，如您第一次使用或不了解该商品的使用方法等，请通过商品详情查看商品标签的中文翻译或联系客服。因客户使用不当导致的损害将由客户自己承担。

4、您购买的跨境商品符合原产地有关品质、健康标识的相关标准，与我国产品标准或有所不同，由此可能造成的危害、损失或者其他风险，由您承担责任。

5、基于监管要求和获得更好的服务，您同意瑞库客保留您的身份信息及收货信息，并授权瑞库客根据需要将必要信息披露给中国海关及商品物流商。瑞库客将对用户的信息给予保密，除非得到您的授权或法律法规另有规定，瑞库客不会向外界披露。

6、您已知悉并确认所购买的跨境商品不适用“七天无理由退换货”，如有质量问题，请及时联系瑞库客客服。如您不同意该项内容，则应立即停止使用本服务。同时，也请您知悉境外商品的包装更注重环保和便捷，而不是注重奢华，大部分的境外一线品牌、奢侈品的包装均比较简单。

7、如您发现任何人未经授权使用您的登录名和密码，或发生违反您意志的交易行为的，请及时联系瑞库客客服处理，避免产生损失。

8、对发生下列情形之一所造成的不便或损害，瑞库客将免责：

a ）定期检查或施工，更新软硬件而造成的服务中断，或突发性的软硬件设备与电子通信设备故障；

b ）网络服务提供商线路或其他故障，黑客攻击、病毒入侵等，服务器遭受损害，无法正常运作；

c ）在紧急情况之下依照法律的规定而采取的措施；

d ）因您提供的身份信息不完整或不准确而导致的通关失败或其他损失的，将由您承担责任；

e ）您与其它任何第三方的纠纷。

9、您保证遵守《海关法》和国家关法律法规，保证所提供的身份信息和收货信息完整，无侵犯他人权益的行为，以上委托关系系如实填写，用户愿意接受海关、检验检疫机构及其他监管部门的监管，并承担相应法律责任。

10、您同时应遵守已签署的《瑞库客用户协议》的相关规定。''',
          style: TextStyle(
            color: Color(0xFF666666),
            fontSize: rSP(10),
          ),
        ),
      ),
    );
  }
}
