class AgreementsMD {
  static const String liveAgreement = '''
## 提示条款
        为使用瑞库客平台直播服务，您应当认真阅读并遵守《瑞库客直播服务申明》（以下简称“本申明”）。 **请您在进一步操作之前务必审慎阅读、充分理解本申明各项规定**。

        您有权选择同意或不同意本申明。当您按照页面提示勾选同意本申明，即视为您已充分阅读、理解并接受本申明的全部内容。 **阅读本申明的过程中，如果您不同意本申明或其中任何条款约定，您应立即停止使用瑞库客平台直播服务**。

        为规范瑞库客平台直播业务的基本秩序，创造良好的直播生态，保障瑞库客平台所有用户的合法权益，特制定本申明。

## 一、适用范围
        本申明适用于使用瑞库客直播发布内容的所有用户，包括主播、互动参与用户（统称为“用户”）。
本申明适用于所有信息形式，包括但不限于用户的昵称、签名、头像以及发布的文字、图片、视频、直播封面、直播内容等。

## 二、基本申明
        用户需遵守国家有关法律、法规、政策及本申明，对于用户违法、违规或违反本申明（包括但不限于言论发表、传送等）而引起的一切责任，由用户负全部责任。
主播有义务保证直播环境健康和谐，为主播直播间信息等所有直播内容负责，若有违规行为，需自行承担全部责任。
互动参与用户有义务保证评论环境健康和谐，为发布的信息内容负责，若有违规行为，需自行承担全部责任。

## 三、具体行为规范
        用户若出现以下违规行为，一经认定，瑞库客平台视情节程度进行相应处理。

### （一）A类违规行为及处理
#### A类违规行为：
1)发布严重涉党和国家的违规内容，包括但不限于：

  a.发布反党、反政府或带有侮辱、诋毁党和国家及国家领导人的内容；
  
  b.危害国家安全，传播党和政府、国家涉密信息，破坏社会稳定和国家统一的行为；
  
  c.发布违反国家宗教政策和民族统一的内容，宣扬邪教或其他封建迷信的行为。

2)传播淫秽色情信息，包括不限于：

  a.通过音频、文字、图片、视频、语言直接或者间接传播性行为；
  
  b.直播中发布利用影射、挑逗等方式引起他人类似感受的音频、文字、图片、视频。

3)宣扬暴恐、危害生命安全等信息。

4)出现违反国家法律法规规定的禁止行为，包括但不限于：
  
  a.贩卖传播或展示枪械、毒品或其他管制物品等违法行为；
  
  b.煽动、组织非法集会、结社、游行、示威、扰乱社会秩序的行为；
  
  c.宣扬颓废的人生观、世界观和价值观，肆意传播谣言，夸大社会黑暗；
  
  d.含有中国法律、行政法规以及任何具有法律效力之规范所限制或禁止的其它内容的。

5)发布虚假信息，包括但不限于：
  
  a.捏造或夸大事实真相（事件/商品），造成严重不良后果；
  
  b.利用虚假中奖、虚假活动等形式，引诱关注或互动的行为。
#### 违规处理:
        用户如出现以上A类违规行为，瑞库客平台将对直播或留言内容进行删除、留底，永久封禁用户账号，并保留移交司法机关的权利。

### （二）B类违规行为及处理
#### B类违规行为:
1)发布侮辱、诋毁国家和国家政策的内容，包括但不限于：
  
  a.改编国歌或以军旗、党旗、国旗等背景直播；
  
  b.发布违反国家宗教法规的内容；
  
  c.传播封建迷信的内容；
  
  d.妄议国家政策法规，造成不良影响；
  
  e.恶意丑化国家形象和含有国家象征的物品；
  
  f.含有法律、法规禁止的其他内容。

2)着装不规范带有性暗示、以及其他具有性暧昧的行为，包括但不限于：
  
  a.穿着大尺度服饰、紧身衣、透明装、睡衣裙、内衣外穿、半截抹胸等；
  
  b.拉扯衣服、搔首弄姿，模拟涉性动作的行为；
  
  c.通过镜头或言语等聚焦敏感部位博取眼球；
  
  d.播放低俗音乐、模仿涉性的低俗声音；
  
  e.利用制造低俗话题，引导关注；

3)有违社会公序良俗的内容，包括但不限于：
  
  a.侮辱、诽谤他人或者涉及他人隐私，侵害他人合法权益；
  
  b.直播未经当事人同意公开泄露他人隐私信息；
  
  c.直播违反社会公德、人伦道德，发布坑蒙拐骗方法的行为；
  
  d.宣传违反不良价值观；
  
  e.展示暴力，使用羞辱性、歧视性的谩骂等语言。

4)其他国家规定和扰乱平台秩序的行为：
  
  a.宣传其他竞品的行为；
  
  b.辱骂诋毁平台的行为；
  
  c.利用平台售卖平台规定外的其他产品，以次充好等影响平台声誉的行为；
  
  d.以宗教为名开展直播录播拜佛烧香；
  
  e.未经授权使用“电视台”“电台”“TV”等广播电视专有名称进行直播；
  
  f.恶意刷屏；
  
  g.其他违反健康生态的行为。

5) 骗取他人财物，包括但不限于：
  
  a.销售价高质低、虚假物品等方式诈骗、骗取他人财物；
#### 违规处理:
        用户如出现以上B类违规行为，瑞库客平台将依据情况对直播或留言内容进行删除、留底，并对用户进行提醒、账号停播、封禁账号等处理。

### （三）C类违规行为及处理
#### C类违规行为

  1)在直播中抽烟、酗酒等行为；

  2)直播过程中长时间黑屏，无人等挂机状态达到15分钟以上；

  3)发布不实信息，包括不限于使用极端词汇“全球唯一”“全国最佳”等；

  4)未满18周岁且未经监护人同意进行直播的行为；

  5)表演危害人身安全的内容，以此吸引眼球的表演，包括但不限于自杀、酗酒、自残自虐、虐待他人或展示各种令人不适的物品、活物、死物等；

  6)利用人的猎奇心理，直播重口味内容、探险灵异、身体残缺或以残忍方式伤害动物等行为；

  7)在开车时进行直播行为；

  8)直播未经官方审核或批准的商业合作及推广行为；

  9)直播中长时间采用或转播未经授权的综艺、电影、电视剧、体育赛事等行为。

#### 违规处理:
        用户如出现以上C类违规行为，瑞库客平台将依据情况对直播或留言内容进行删除、留底，并对用户进行提醒、账号停播、短期账号封禁等处理，特别严重的将封禁账号。

## 四、附则
        瑞库客平台可根据国家法律法规变化及维护直播秩序、保护用户权益需要，不时修改本申明。 如用户不同意更新后的申明内容，应当停止使用瑞库客平台直播服务，如用户在新的申明版本生效后仍继续使用瑞库客平台直播服务的，则视为用户同意接受新的申明。

        本申明若存在与法律法规、现行行业规范相抵触之处，以法律法规、现行行业规范为准。

        本申明的解释权归瑞库客平台所有。

        本申明自2020年7月16日起施行。


  ''';

  static const String privacy = '''# 用户使用协议

请您本产品之前，请务必仔细阅读并理解《用户许可使用协议》（以下简称“本协议”）中规定的多有权利和限制。
我们一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）不受到任何侵犯。
本协议（包括本文最后部分的隐私政策）是用户（包括通过各种合法途径获取到本产品的自然人、法人或其他组织机构，以下简称“用户”或“您”）与我们之间针对本产品相关事项最终的、完整的且排他的协议，并取代、合并之前的当事人之间关于上述事项的讨论和协议。
本协议将对用户使用本产品的行为产生法律约束力，您已承诺和保证有权利和能力订立本协议。用户开始使用本产品将视为已经接受本协议，请认真阅读并理解本协议中各种条款，包括免除和限制我们的免责条款和对用户的权利限制（未成年人审阅时应由法定监护人陪同），如果您不能接受本协议中的全部条款，请勿开始使用本产品。

## 一、账户

**您必须承诺和保证：**

您使用本产品的行为必须合法。
本产品将会依据本协议“修改和终止”的规定保留或终止您的账户。您必须承诺对您的登录信息保密、不被其他人获取与使用，并且对您在本账户下的所有行为负责。您必须将任何有可能触犯法律的、未授权使用或怀疑为未授权使用的行为在第一时间通知本产品。本产品不对您因未能遵守上述要求而造成的损失承担法律责任。

## 二、用户终端协议

1.许可
依据本协议规定，本产品将授予您以下不可转让的、非排他的许可：

① 使用本产品的权利；

② 在您所有的网络通信设备、计算机设备和移动通信设备上下载、安装、使用本产品的权利。

2.限制性条款

本协议对您的授权将受到以下限制：

① 您不得对本产品进行任何形式的许可、出售、租赁、转让、发行或其他商业用途；

② 除非法律禁止此类限制，否则您不得对本产品的任何部分或衍生产品进行修改、翻译、改编、合并、利用、分解、改造或反向编译、反向工程等；

③ 您不得以创建相同或竞争服务为目的使用本产品；

④ 除非法律明文规定，否则您不得对本产品的任何部分以任何形式或方法进行生产、复制、发行、出售、下载或显示等；

⑤ 您不得删除或破坏包含在本产品中的任何版权声明或其他所有权标记。

3.费用

您必须自行负担购买本产品的费用，个人上网或第三方（包括但不限于电信或移动通讯提供商）收取的通讯费、信息费等相关费用。如涉及电信增值服务，我们建议您与增值服务提供商确认相关费用问题。

4.版本

任何本产品的更新版本或未来版本、更新或者其他变更将受到本协议约束。

## 三、遵守法律

您同意遵守《中华人民共和国合同法》、《中华人民共和国著作权法》及其实施条例、《全国人民代表大会常务委员会关于维护互联网安全的决定》（“人大安全决定”）、《中华人民共和国保守国家秘密法》、《中华人民共和国电信条例》（“电信条例“）、《中华人民共和国计算机信息系统安全保护条例》、《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法、《计算机信息系统国际联网保密管理规定》、《互联网信息服务管理办法》、《计算机信息网络国际联网安全保护管理办法》、《互联网电子公告服务管理规定》（“电子公告规定”）等相关中国法律法规的任何及所有的规定，并对以任何方式使用您的密码和您的账号使用本服务的任何行为及其结果承担全部责任。如违反《人大安全决定》有可能构成犯罪，被追究刑事责任。《电子公告规定》则有明文规定，上网用户使用电子公告服务系统对所发布的信息负责。《电信条例》也强调，使用电信网络传输信息的内容及其后果由电信用户负责。在任何情况下，如果本网站有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反上述法律和法规的任何规定，本网站可在任何时候不经任何事先通知终止向您提供服务。

## 四、用户内容

1. 用户内容是指该用户下载、发布或以其他方式使用本产品时产生的所有内容（例如：您的信息、图片、音乐或其他内容）。

2. 您是您的用户内容唯一的责任人，您将承担因您的用户内容披露而导致的您或任何第三方被识别的风险。

3. 已同意您的用户内容受到权利限制（详见“权利限制”）

## 五、权利限制

您已同意通过分享或其他方式使用本产品中的相关服务，在使用过程中，您将承担因下述行为所造成的风险而产生的全部法律责任：
破坏宪法所确定的基本原则的；

1. 危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；
2. 损害国家荣誉和利益的；
3. 煽动民族仇恨、民族歧视，破坏民族团结的；
4. 破坏国家宗教政策，宣扬邪教和封建迷信的；
5. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
6. 侮辱或者诽谤他人，侵害他人合法权益的；
7. 含有法律、行政法规禁止的其他内容的。

您已经同意不在本产品从事下列行为：

1. 发布或分享电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；
2. 未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等；
3. 用自动化的方式恶意使用本产品，给服务器造成过度的负担或以其他方式干扰或损害网站服务器和网络链接；
4. 在未授权的情况下，尝试访问本产品的服务器数据或通信数据；
5. 干扰、破坏本产品其他用户的使用。

## 六、修改和终止

1. 修改

本协议容许变更。如果本协议有任何实质性变更，我们将通过电子邮件来通知您。变更通知之后，继续使用本产品则为您已知晓此类变更并同意条款约束。  
我们保留在任何时候无需通知而修改、保留或关闭本产品任何服务之权利；  
您已同意我们无需因修改、保留或关闭本产品任何服务之权利；  
您已同意我们无需因修改、保留或关闭本产品任何服务的行为对您或第三方承担责任。

2. 终止

本协议自您接受之日起生效，在您使用本产品的过程中持续有效，直至依据本协议终止；  
尽管有上述规定，如果您使用本产品的时间早于您接受本协议的时间，您在此知晓并同意本协议于您接受本协议的时间，您在此知晓并同意本协议于您第一次使用本产品时生效，除非依据本协议提前终止；  
我们可能会依据法律的规定，保留您使用本产品或者本账户的权利；无论是否通知，我们将在任何时间以任何原因终止本协议，包括出于善意的相信您违反了我们可接受使用政策或本协议的其他规定；  
不受前款规定所限，如果用户侵犯第三人的版权且我们接到版权所有人或版权所有人的合法代理人的通知后，我们保留终止本协议的权利；  
一旦本协议终止，您使用本产品的权利即告终止。您应当知晓您的产品终止意味着您的用户内容将从我们的活动数据库中删除。我们不因终止本协议对您承担任何责任，包括终止您的用户账户和删除您的用户内容。

## 七、第三方

1. 您已知晓或同意我们的部分服务时基于第三方的技术支持获得  
您已知晓本协议是您在与我们之前签订，而非您与上述第三方之间签订。我们是基于本产品所产生的内容、维护、支持服务、保证和由此产生的诉讼等事项的唯一责任人。您已同意遵守且授权给本产品限制您有条件地使用本产品的服务。
2. 第三方信息和服务  
2.1 本产品包含了第三方的部分信息和服务。我们不控制且不对第三方的信息和服务负责；  
2.2 我们仅为您使用方便的目的或为承诺和保证第三方的需要而提供此类信息和服务；  
2.3 用户需对使用第三方信息和服务产生的风险承担法律责任；  
2.4 当用户访问第三方信息和服务时，适用第三方的条款和政策。

## 八、赔偿

1. 您已同意无害地使用本产品，避免因下述行为或相关行为遭受来第三方的任何投诉、诉讼、损失、损害、责任、成本和费用（包括律师费）：
用户使用本产品的行为；
用户的用户内容；
用户违反本协议的行为。
2. 我们保留专属抗辩权和请求赔偿的权利
3. 您已同意，除非获得我们书面同意，您不得在您与我们共同对第三方提起的诉讼中单方和解。
4. 我们将尽合理努力将此类诉讼、诉讼行为或进程通知您。
5. 在任何情况下，本产品都不对您或任何第三方因本协议产生的任何间接性、后果性、惩罚性的、偶然的、特殊或惩罚性的损害赔偿承担责任。访问、使用本产品所产生的损坏计算机系统或移动通讯设备数据的风险将由您个人承担。

## 九、适用法律

1. 本协议适用中华人民共和国法律；
2. 如果双方发生纠纷，应本着友好的圆柱协商解决；如协商不成，应向所在地的法院提起诉讼。

## 十、独立性

本协议中的某些条款因故无法适用，则本协议的其他条款继续适用且无法适用的条款将会被修
改，以便其能够依法适用。

## 十一、完整性

本协议（包括隐私政策）是您和本产品之间关于本产品相关事项的最终的、完整的、排他的协议，且取代和合并之前当事人关于此类事项（包括之前的最终用户许可、服务条款和隐私政策）的讨论和协议；
每部分的题目只为阅读之便而无任何法律或合同义务；
除非我们书面同意，您不得转让本协议所规定的权利义务。任何违反上述规定企图转让的行为均无效。

# 隐私政策

请您在开始使用我们的产品（以下简称“本产品”）之前请务必仔细阅读并理解《隐私政策》（以下简称“本政策”）。  
我们一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）。我们力求明确说明我们是如何收集、使用、披露、传送及存储您的信息的。虽然本政策适用于我们的所有服务，但我们也针对特定服务制定了某些明确的某些明确的隐私权补充条文，其中包含有关我们的信息处理做法的其他信息。当我们进行其它数据收集处理活动时会另外取得您的同意。请务必仔细阅读本隐私政策，因为只要您使用我们的服务，就表示您同意隐私政策及补充条文中所描述的做法，如果您不同意隐私政策中所描述的做法，请不要使用我们的服务。  
您可以通过多种不同的方式使用我们的服务。基于此目的，我们将向您解释我们对信息的收集和使用方式，以及您可采用什么方式来保护自己的隐私权。  
我们的隐私政策包括了以下几个方面的问题：

1. 我们收集哪些信息
2. 我们如何收集和使用信息
3. 您如何访问和控制自己的个人信息
4. 信息的分享、安全以及隐私政策的使用范围和变更

## 一、我们会收集哪些信息

您通过我们的服务向其他方提供的共享信息，以及您使用我们服务过程中收集的信息所；
除了您提供的信息外，我们还可能通过您设备中的软件以及其他方式来收集您使用我们的服务的相关信息，如设备信息、日志信息、位置信息等；

## 二、我们如何收集和利用信息

1. 个人信息的收集和使用  
您与我们及其关联公司进行互动时，您可能会被要求提供您同意使用我们基本产品服务所必需的某些个人信息。该个人信息可能与其他信息合并在一起，被用于改进我们的产品或服务等。下文是我们可能收集的个人信息的类型以及我们如何使用该信息的一些示例。  
1.1 个人信息的收集  
为使您使用产品/服务更便捷或更有乐趣，从而提升您在瑞库客的用户体验，我们可能在以下功能中收集和使用您的个人信息。如果您不提供这些个人信息，您依然可以使用瑞库客，但您可能无法使用购物功能或其他可以为您所带来购物乐趣的附加功能。
1.2 个人信息的使用  
（a）成为会员及会员登录  
为成为我们的会员，以便我们为您提供会员服务，您需要提供您本人的手机号码用于创建瑞库客平台账户。您提交的手机号码用于您注册、登录、绑定账户，并且作为您与我们指定的联系方式之一，用来接受相关业务通知（如产品更新、服务优化等）或进行业务沟通。如果您仅需使用浏览、搜索等基本服务，您不需要注册成为我们的会员及提供上述信息。对于需要通过瑞库客平台账户才能使用的服务，我们可能会根据您提供的上述信息校验您的会员身份，确保我们是在为您本人提供服务。  
您可以修改补充您的头像、昵称、性别、生日、微信号以及您的实名认证相关信息，这些信息均属于您的“会员信息”。您补充的会员信息将有助于我们为您提供个性化的产品/服务推荐和更优的用户体验。其中，为保证您的身份辨识度，您的昵称、头像将公开显示。但如果您不提供这些补充信息，不会影响您网上购物的基本浏览、搜索、购买功能及您享受视频浏览这一功能。  
您还可以选择授权使用微信账号登录，你确认同意《瑞库客平台服务协议》和本隐私政策并授权后，我们会从微信获取您共享的账号信息（头像、昵称、地区、性别），并将您的微信账户与您的瑞库客账户绑定，使您可以通过微信账户直接登录并使用我们的产品与/或服务。我们会依据与微信运营方的约定，在符合相关法律和法规规定的前提下，使用您的这些个人信息。
实名认证：为获取更为丰富的功能或会员服务，您可以根据认证要求向我们提供相应的身份信息（姓名、身份证号），我们会将上述信息共享给第三方服务机构以完成实名认证。如果您不提供该类个人信息，您将无法享受我们提供的余额提现服务，但不会影响您享受网上购物、视频浏览等基础核心业务功能。  
（b）下单功能  
当您准备对您拟购买的商品进行结算时，瑞库客会生成您购买该商品的订单，同时该订单中会载明您所购买的商品或服务信息、订单号、订单创建时间、您应支付的货款金额及支付方式。
您可以通过瑞库客为其他人订购商品及/或服务，您需要提供该实际订购人的前述个人信息。向瑞库客提供该实际订购人的前述个人信息之前，您需确保您已经取得其授权同意。  
当您购买一般商品时，您需要在订单中至少填写您的收货人姓名、收货地址以及手机号码；当购买跨境商品时，您还可能需要根据国家法律法规的要求提供您或实际订购人的实名信息。  
上述所有信息构成您的“订单信息”，我们将使用或向第三方共享您的订单信息来进行您的身份核验、确定交易、支付结算、完成配送、为您查询订单以及提供客服咨询与售后服务；我们还会使用您的订单信息来判断您的交易是否存在异常以保护您的交易安全。  
（c）支付功能  
在您下单后，您可以选择与瑞库客合作的第三方支付机构（包括支付宝、微信、银联等支付通道， 以下称“支付机构”）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的瑞库客订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。  
为使我们及时获悉并确认您的支付进度及状态，为您提供售后与客服服务，您同意我们可自您所选择的交易对象、第三方支付机构处收集与支付进度相关信息。  
（d）交付产品或服务功能  
为保证您购买的产品及/或服务能够顺利、安全、准确送达，我们会根据产品及/或服务提供主体的指定向相应的物流服务主体同步订单信息。您知晓并同意相应物流服务主体不可避免地获知及使用您的配送信息，用于完成交付目的。  
为使我们及时获悉并确认交付进度及状态，向您提供售后服务，您同意我们可自物流相关服务主体处收集与交付进度相关信息。  
（e）附加功能  
① 基于位置信息的天气查询附加功能：我们会在您开启位置权限后访问获取您的位置信息（我们仅获取您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹）来判断您所处的地点，以期为您展示您所在位置的当日天气。  
② 基于摄像头（相机）的附加功能：您可以在开启相机/摄像头权限后使用这个附加功能完成直播、视频拍摄、拍照、扫一扫等功能。  
③ 基于读取外部存储的图片/视频访问及上传的附加功能：您可在开启读取外部存储权限后使用该功能上传您的照片/图片/视频，以实现更换头像、发表评价、音视频分享或与客服沟通提供证明等功能。我们可能会使用包含您所上传照片或图片的评价信息。  
④ 基于写入外部存储的图片保存的附加功能：您可在开启写入外部存储权限后使用该功能保存商品图片。  
⑤ 基于麦克风的语音技术的附加功能：您可在开启麦克风权限后使用麦克风来进行音视频的录制或进行直播。请您知晓，即使您已同意开启麦克风权限，我们也仅会在您录制视频或直播时获取语音信息。  
⑥ 基于微信的附加功能：在您自主填写微信号后，我们及/或我们的关联方、合作伙伴可能向您发起好友添加申请，用于向您提供更便捷的产品及/或服务的使用指导和沟通。您有权自由选择是否添加微信二维码或关联微信，若您选择添加或关联，您理解并同意，受限于本隐私政策的相关条款，我们可能会将您的微信二维码与我们的合作伙伴共享。  
⑦ 基于手机状态的收集崩溃日志的附加功能：在您开启读取手机状态权限后，我们及/或我们的关联方、合作伙伴会在您的瑞库客app崩溃时收集崩溃日志。  
您理解并同意，上述附加功能可能需要您在您的设备中向我们开启您的地理位置（位置信息）、相机（摄像头）、读取/写入外部存储（图片库）、麦克风（语音）、手机状态的访问权限，以实现这些功能所涉及的信息的收集和使用。您可在您的设备设置中逐项查看您上述权限的开启状态，并可以决定将这些权限随时的开启或关闭（如适用）。对于基于微信的附加功能，您可以在我们的产品或服务中添加或删除您的微信号，以决定该项功能的开启或关闭。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来实现对应的功能，您一旦关闭任一权限即代表您取消了授权，则我们将不再基于对应权限继续收集和使用您的相关个人信息，也无法为您提供与该授权所对应的功能。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。  
非个人信息的收集和使用  
同时，为了运营和改善我们的技术和服务，我们将会自行收集使用您的非个人信息，这将有助于我们向您提供更好的用户体验和提高服务质量。  
2.1 非个人信息的收集  
日志信息—当您使用我们的服务等时，我们的服务器会自动记录某些日志信息。这类服务器日志信息可能包含如下信息：IP地址、浏览器类型、浏览器语言、refer来源页、操作系统、日期/时间标记和点击流数据。
2.2 Cookie的使用  
Cookie技术：您访问我们平台相关网站或使用我们官网平台提供的服务时，我们可能会通过小型数据文件识别您的身份，这么做是帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie，FlashCookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。  
（a）在您未拒绝接受Cookies的情况下，本应用会在您的计算机上设定或取用Cookies ，以便您能登录或使用依赖于Cookies的本应用平台服务或功能。本应用使用Cookies可为您提供更加周到的个性化服务，包括推广服务。  
（b）您有权选择接受或拒绝接受Cookies。您可以通过修改浏览器设置的方式拒绝接受Cookies。但如果您选择拒绝接受Cookies，则您可能无法登录或使用依赖于Cookies的本应用网络服务或功能。  
（c）通过本应用所设Cookies所取得的有关信息，将适用本政策。  

## 三、您如何访问和控制自己的个人信息

我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。

## 四、信息的分享、安全以及隐私政策的使用范围和变更

1. 我们如何共享信息  
除非本隐私政策载明的有限共享，我们会严格保密您的个人信息。未经您的同意，我们将不会向第三方披露您的信息以用于其各自的独立市场营销或商业用途。您于此授权，以下情形我们将会向第三方共享您的个人信息而无需通过您的同意：  
1.1 业务合作伙伴  
我们也可能与可信的业务合作伙伴（包括无线运营商）共享您的信息。这些实体可能使用您的信息来提供您请求的服务、对您的喜好进行预测、并可能向您提供促销材料、广告以及其他材料。  
1.2 服务提供商  
我们也可能向为我们或代表我们提供服务的公司披露您的信息，如协助我们处理账单或代表我们发送电子邮件的公司，但这些实体只能将您的信息用于为我们提供服务。  
1.3 法律要求或保护我们的服务所必需的其他各方。在有些情况下我们可能会向其他各方披露您的信息；  
1.4 遵守法律或服从强制性的法律程序（如搜查证或其他法院命令）；  
1.5 确认或强制遵循我们的服务策略；以及保护我们及我们的各个附属公司、业务合作伙伴或客户的权利、财产或安全；  
1.6 与公司事务有关的其他各方。在公司合并、转让或破产过程中，我们可能会向第三方披露您的信息；  
1.7 征得您同意的其他各方。除本政策中描述的披露情况之外，我们也可能在您同意共享或提出共享请求时与第三方共享您的信息；  
2. 我们如何确保您的信息安全  
您的账户均有安全保护功能，请妥善保管您的账户及密码信息。我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息；  
我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题；  
我们只允许那些为了帮我们处理个人信息而需要知晓这些信息的员工、授权代为处理服务公司的人员访问个人信息，而且他们需要履行严格的合同保密义务，如果其未能履行这些义务，就可能会被追究法律责任或被终止其与我们的关系；  
对我们来说，您的信息的安全非常重要。因此，我们将不断努力保障您的个人信息安全，并实施存储和传输全程安全加密等保障手段、以免您的信息在未经授权的情况下被访问、使用或被披露。同时某些加密数据的具体内容，除了用户自己，其他人都无权访问。  
3. 对儿童个人信息的收集和使用  
我们建议13周岁以下的儿童在其法定监护人的许可和指导下使用产品或服务。
我们不会在明知对方为儿童的情况下收集其个人信息，也不会向任何第三方透露其个人信息，监护人有权拒绝我们及其关联公司进一步收集被监护人的个人信息，或要求我们及关联公司删除该被监护人个人信息。如果我们发现我们收集了年龄不满13周岁的儿童的个人信息，我们将采取措施尽快地删除此等信息。

## 五、变更

我们可能适时修订本《隐私政策》的条款，该修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页显著位置提示或者向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。

  ''';
}
