class AgreementsMD {
  static const String liveAgreement = '''
## 提示条款
        为使用瑞库客平台直播服务，您应当认真阅读并遵守《瑞库客直播服务申明》（以下简称“本申明”）。 **请您在进一步操作之前务必审慎阅读、充分理解本申明各项规定**。

        您有权选择同意或不同意本申明。当您按照页面提示勾选同意本申明，即视为您已充分阅读、理解并接受本申明的全部内容。 **阅读本申明的过程中，如果您不同意本申明或其中任何条款约定，您应立即停止使用瑞库客平台直播服务**。

        为规范瑞库客平台直播业务的基本秩序，创造良好的直播生态，保障瑞库客平台所有用户的合法权益，特制定本申明。

## 一、适用范围
        本申明适用于使用瑞库客直播发布内容的所有用户，包括主播、互动参与用户（统称为“用户”）。
本申明适用于所有信息形式，包括但不限于用户的昵称、签名、头像以及发布的文字、图片、视频、直播封面、直播内容等。

## 二、基本申明
        用户需遵守国家有关法律、法规、政策及本申明，对于用户违法、违规或违反本申明（包括但不限于言论发表、传送等）而引起的一切责任，由用户负全部责任。
主播有义务保证直播环境健康和谐，为主播直播间信息等所有直播内容负责，若有违规行为，需自行承担全部责任。
互动参与用户有义务保证评论环境健康和谐，为发布的信息内容负责，若有违规行为，需自行承担全部责任。

## 三、具体行为规范
        用户若出现以下违规行为，一经认定，瑞库客平台视情节程度进行相应处理。

### （一）A类违规行为及处理
#### A类违规行为：
1)发布严重涉党和国家的违规内容，包括但不限于：

  a.发布反党、反政府或带有侮辱、诋毁党和国家及国家领导人的内容；
  
  b.危害国家安全，传播党和政府、国家涉密信息，破坏社会稳定和国家统一的行为；
  
  c.发布违反国家宗教政策和民族统一的内容，宣扬邪教或其他封建迷信的行为。

2)传播淫秽色情信息，包括不限于：

  a.通过音频、文字、图片、视频、语言直接或者间接传播性行为；
  
  b.直播中发布利用影射、挑逗等方式引起他人类似感受的音频、文字、图片、视频。

3)宣扬暴恐、危害生命安全等信息。

4)出现违反国家法律法规规定的禁止行为，包括但不限于：
  
  a.贩卖传播或展示枪械、毒品或其他管制物品等违法行为；
  
  b.煽动、组织非法集会、结社、游行、示威、扰乱社会秩序的行为；
  
  c.宣扬颓废的人生观、世界观和价值观，肆意传播谣言，夸大社会黑暗；
  
  d.含有中国法律、行政法规以及任何具有法律效力之规范所限制或禁止的其它内容的。

5)发布虚假信息，包括但不限于：
  
  a.捏造或夸大事实真相（事件/商品），造成严重不良后果；
  
  b.利用虚假中奖、虚假活动等形式，引诱关注或互动的行为。
#### 违规处理:
        用户如出现以上A类违规行为，瑞库客平台将对直播或留言内容进行删除、留底，永久封禁用户账号，并保留移交司法机关的权利。

### （二）B类违规行为及处理
#### B类违规行为:
1)发布侮辱、诋毁国家和国家政策的内容，包括但不限于：
  
  a.改编国歌或以军旗、党旗、国旗等背景直播；
  
  b.发布违反国家宗教法规的内容；
  
  c.传播封建迷信的内容；
  
  d.妄议国家政策法规，造成不良影响；
  
  e.恶意丑化国家形象和含有国家象征的物品；
  
  f.含有法律、法规禁止的其他内容。

2)着装不规范带有性暗示、以及其他具有性暧昧的行为，包括但不限于：
  
  a.穿着大尺度服饰、紧身衣、透明装、睡衣裙、内衣外穿、半截抹胸等；
  
  b.拉扯衣服、搔首弄姿，模拟涉性动作的行为；
  
  c.通过镜头或言语等聚焦敏感部位博取眼球；
  
  d.播放低俗音乐、模仿涉性的低俗声音；
  
  e.利用制造低俗话题，引导关注；

3)有违社会公序良俗的内容，包括但不限于：
  
  a.侮辱、诽谤他人或者涉及他人隐私，侵害他人合法权益；
  
  b.直播未经当事人同意公开泄露他人隐私信息；
  
  c.直播违反社会公德、人伦道德，发布坑蒙拐骗方法的行为；
  
  d.宣传违反不良价值观；
  
  e.展示暴力，使用羞辱性、歧视性的谩骂等语言。

4)其他国家规定和扰乱平台秩序的行为：
  
  a.宣传其他竞品的行为；
  
  b.辱骂诋毁平台的行为；
  
  c.利用平台售卖平台规定外的其他产品，以次充好等影响平台声誉的行为；
  
  d.以宗教为名开展直播录播拜佛烧香；
  
  e.未经授权使用“电视台”“电台”“TV”等广播电视专有名称进行直播；
  
  f.恶意刷屏；
  
  g.其他违反健康生态的行为。

5) 骗取他人财物，包括但不限于：
  
  a.销售价高质低、虚假物品等方式诈骗、骗取他人财物；
#### 违规处理:
        用户如出现以上B类违规行为，瑞库客平台将依据情况对直播或留言内容进行删除、留底，并对用户进行提醒、账号停播、封禁账号等处理。

### （三）C类违规行为及处理
#### C类违规行为

  1)在直播中抽烟、酗酒等行为；

  2)直播过程中长时间黑屏，无人等挂机状态达到15分钟以上；

  3)发布不实信息，包括不限于使用极端词汇“全球唯一”“全国最佳”等；

  4)未满18周岁且未经监护人同意进行直播的行为；

  5)表演危害人身安全的内容，以此吸引眼球的表演，包括但不限于自杀、酗酒、自残自虐、虐待他人或展示各种令人不适的物品、活物、死物等；

  6)利用人的猎奇心理，直播重口味内容、探险灵异、身体残缺或以残忍方式伤害动物等行为；

  7)在开车时进行直播行为；

  8)直播未经官方审核或批准的商业合作及推广行为；

  9)直播中长时间采用或转播未经授权的综艺、电影、电视剧、体育赛事等行为。

#### 违规处理:
        用户如出现以上C类违规行为，瑞库客平台将依据情况对直播或留言内容进行删除、留底，并对用户进行提醒、账号停播、短期账号封禁等处理，特别严重的将封禁账号。

## 四、附则
        瑞库客平台可根据国家法律法规变化及维护直播秩序、保护用户权益需要，不时修改本申明。 如用户不同意更新后的申明内容，应当停止使用瑞库客平台直播服务，如用户在新的申明版本生效后仍继续使用瑞库客平台直播服务的，则视为用户同意接受新的申明。

        本申明若存在与法律法规、现行行业规范相抵触之处，以法律法规、现行行业规范为准。

        本申明的解释权归瑞库客平台所有。

        本申明自2020年7月16日起施行。


  ''';
}
